date = int(input('Введите день рождения:'))
month =(input('Введите месяц рождения:'))
if (month) == ('декабрь')and (date)<=22 :
     print ('Ваш знак зодиака: Стрелец')
if (month) == ('январь') and (date)<=20 :
     print ('Ваш знак зодиака: Козерог')
if (month) == ('февраль') and (date)<=18 :
     print ('Ваш знак зодиака: Водолей')
if (month) == ('март') and (date)<=20 :
     print ('Ваш знак зодиака: Рыба')
if (month) == ('апрель') and (date)<=19 :
     print ('Ваш знак зодиака: Овен')
if (month) == ('май') and (date)<=20 :
     print ('Ваш знак зодиака: Телец')
if (month) == ('июнь') and (date)<=20 :
     print ('Ваш знак зодиака: Близнецы')
if (month) == ('июлю') and (date)<=22 :
     print ('Ваш знак зодиака: Рак')
if (month) == ('август') and (date)<=22 :
     print ('Ваш знак зодиака: Лев')
if (month) == ('сентябрь') and (date)<=22 :
     print ('Ваш знак зодиака: Дева')
if (month) == ('октябрь') and (date)<=22 :
     print ('Ваш знак зодиака: Весы')
if (month) == ('ноябрь') and (date)<=21 :
     print ('Ваш знак зодиака: Скорпион')
if (month) == ('ноябрь') and (date)>=22 :
     print ('Ваш знак зодиака: Стрелец')